[
  // 30 listing objects will be generated here, each with:
  // - name
  // - description (200+ words)
  // - regularPrice
  // - discountedPrice
  // - imageUrls (from Boker.listing.json)
  // - address
  // - bathrooms
  // - bedrooms
  // - furnished
  // - parking
  // - type
  // - offer
  // - userRef: "<USER_ID_PLACEHOLDER>"
  // - location (city)
  // - email: "<EMAIL_PLACEHOLDER>"
  // The actual data will be filled in the next step.
  {
    "name": "DLF Phase 5 Penthouse Gurgaon",
    "description": "Experience the epitome of luxury living in this stunning penthouse located in the prestigious DLF Phase 5, Gurgaon. This property boasts a private elevator that opens directly into your spacious foyer, ensuring both privacy and convenience. The expansive living and dining areas are designed for both grand entertaining and intimate family gatherings, featuring floor-to-ceiling windows that flood the space with natural light and offer panoramic views of the city skyline. The home theater is perfect for movie nights, while the gourmet kitchen is equipped with top-of-the-line appliances for culinary enthusiasts. Each of the six bedrooms is a private retreat, complete with en-suite bathrooms and ample closet space. The master suite includes a spa-inspired bathroom and a walk-in wardrobe. Residents enjoy access to world-class amenities, including a fitness center, swimming pool, and landscaped gardens. With top schools, hospitals, and shopping centers just minutes away, this penthouse is ideal for those seeking a premium lifestyle in Gurgaon. Security is paramount, with 24/7 surveillance and dedicated parking. This is more than a home—it's a statement of success and sophistication, offering unparalleled comfort and convenience in one of Gurgaon's most sought-after neighborhoods.",
    "regularPrice": 35000000,
    "discountedPrice": 32000000,
    "imageUrls": [
      "https://images.unsplash.com/photo-1519125323398-675f0ddb6308",
      "https://images.unsplash.com/photo-1519985176271-adb1088fa94c",
      "https://images.unsplash.com/photo-1507089947368-19c1da9775ae"
    ],
    "address": "1010 DLF Phase 5, Gurgaon",
    "bathrooms": 5,
    "bedrooms": 6,
    "furnished": true,
    "parking": true,
    "type": "apartment",
    "offer": true,
    "userRef": "<USER_ID_PLACEHOLDER>",
    "location": "Gurgaon",
    "email": "<EMAIL_PLACEHOLDER>"
  },
  {
    "name": "C Scheme Heritage Jaipur",
    "description": "Step into a world where tradition meets modernity in this exquisite heritage home located in the heart of Jaipur's C Scheme. This property is a celebration of Rajasthani architecture, featuring intricately carved arches, vibrant frescoes, and a sprawling central courtyard that serves as the soul of the home. The rooftop terrace offers breathtaking views of the Pink City, making it an ideal spot for evening gatherings or quiet reflection. Inside, the four spacious bedrooms are designed for comfort, each with large windows that let in ample sunlight and cool breezes. The fully equipped kitchen is perfect for preparing family feasts, while the living area, adorned with traditional decor, is a warm and inviting space for entertaining guests. The home is situated in a peaceful neighborhood, close to renowned schools, hospitals, and shopping destinations. Modern amenities blend seamlessly with heritage charm, offering air conditioning, high-speed internet, and secure parking. This property is perfect for families who value culture, comfort, and community, providing a unique living experience that is both luxurious and deeply rooted in Jaipur's rich history. Discover the perfect blend of old-world elegance and contemporary convenience in this one-of-a-kind residence.",
    "regularPrice": 16000000,
    "discountedPrice": 14000000,
    "imageUrls": [
      "https://images.unsplash.com/photo-1467987506553-8f3916508521",
      "https://images.unsplash.com/photo-1506744038136-46273834b3fb",
      "https://images.unsplash.com/photo-1464037866556-6812c9d1c72e"
    ],
    "address": "909 C Scheme, Jaipur",
    "bathrooms": 3,
    "bedrooms": 4,
    "furnished": false,
    "parking": true,
    "type": "house",
    "offer": true,
    "userRef": "<USER_ID_PLACEHOLDER>",
    "location": "Jaipur",
    "email": "<EMAIL_PLACEHOLDER>"
  },
  {
    "name": "Marine Drive View Mumbai",
    "description": "Wake up to the soothing sound of waves and the mesmerizing view of the Arabian Sea in this luxurious sea-facing apartment on Marine Drive, Mumbai. This modern home features two spacious balconies that offer panoramic vistas, perfect for enjoying your morning coffee or unwinding after a long day. The interiors are thoughtfully designed with contemporary finishes, including Italian marble flooring, designer lighting, and custom cabinetry. The gourmet kitchen is a chef's dream, equipped with high-end appliances and ample storage. The master suite is a sanctuary of comfort, boasting a walk-in closet and a spa-inspired bathroom with a soaking tub. Additional bedrooms are generously sized, ideal for family or guests. The building offers premium amenities such as a fitness center, swimming pool, and 24/7 security. Located in one of Mumbai's most prestigious neighborhoods, you are just steps away from fine dining, shopping, and cultural attractions. This apartment is not just a home; it's a lifestyle choice for those who appreciate the finer things in life. With secure parking and easy access to major transport links, this property combines luxury, convenience, and breathtaking natural beauty in one of India's most iconic locations.",
    "regularPrice": 30000000,
    "discountedPrice": 27000000,
    "imageUrls": [
      "https://www.embassyindia.com/wp-content/uploads/2017/06/2O0A6971-Edit-2-1.jpg",
      "https://www.embassyindia.com/wp-content/uploads/2017/03/sky-living-room-1.jpg",
      "https://www.embassyindia.com/wp-content/uploads/2016/02/IBB_GrdFlr_Study_9337-7.jpg"
    ],
    "address": "1201 Marine Drive, Mumbai",
    "bathrooms": 2,
    "bedrooms": 3,
    "furnished": true,
    "parking": true,
    "type": "apartment",
    "offer": true,
    "userRef": "<USER_ID_PLACEHOLDER>",
    "location": "Mumbai",
    "email": "<EMAIL_PLACEHOLDER>"
  },
  {
    "name": "DLF Golf Course Villa Gurgaon",
    "description": "Nestled in the prestigious DLF Golf Course area of Gurgaon, this luxury villa redefines opulent living. The property features a private pool and a lush garden, perfect for relaxation and entertaining guests. With five spacious bedrooms, each with en-suite bathrooms, this villa is ideal for large families or those who love to host. The home theater provides a cinematic experience, while the smart home features ensure convenience and security at your fingertips. The gourmet kitchen is equipped with the latest appliances, making it a chef's delight. Large windows throughout the villa allow for plenty of natural light and offer stunning views of the surrounding greenery. The villa is part of a gated community with 24/7 security, a clubhouse, and access to world-class amenities such as a gym, spa, and tennis courts. Its prime location means you are close to top schools, hospitals, and shopping centers. This villa is not just a home; it's a lifestyle choice for those who demand the best in comfort, style, and exclusivity. Experience the perfect blend of luxury and tranquility in one of Gurgaon's most sought-after neighborhoods.",
    "regularPrice": 50000000,
    "discountedPrice": 45000000,
    "imageUrls": [
      "https://www.embassyindia.com/wp-content/uploads/2019/04/03-Club-House-Swimming-Pool-6.jpg",
      "https://www.embassyindia.com/wp-content/uploads/2015/12/1-15.jpg",
      "https://www.embassyindia.com/wp-content/uploads/2015/12/1-7.jpg"
    ],
    "address": "45 DLF Golf Course, Gurgaon",
    "bathrooms": 5,
    "bedrooms": 5,
    "furnished": true,
    "parking": true,
    "type": "villa",
    "offer": true,
    "userRef": "<USER_ID_PLACEHOLDER>",
    "location": "Gurgaon",
    "email": "<EMAIL_PLACEHOLDER>"
  },
  {
    "name": "Salt Lake Modern Home Kolkata",
    "description": "Located in the vibrant Salt Lake City of Kolkata, this contemporary home offers a perfect blend of comfort and style. The spacious living area is ideal for family gatherings, while the modular kitchen is equipped with state-of-the-art appliances for effortless cooking. The home features three bedrooms and two bathrooms, each designed with modern fixtures and ample storage. A lush backyard provides a serene escape, perfect for outdoor dining or gardening. The property is situated in a safe and friendly neighborhood, close to top schools, shopping malls, and healthcare facilities. With easy access to public transport, commuting is a breeze. The home is semi-furnished, allowing you to add your personal touch. Additional amenities include secure parking, high-speed internet, and a dedicated utility area. Whether you are a young family or a professional seeking a peaceful retreat, this home offers everything you need for a comfortable and convenient lifestyle in one of Kolkata's most desirable areas.",
    "regularPrice": 18000000,
    "discountedPrice": 16000000,
    "imageUrls": [
      "https://www.embassyindia.com/wp-content/uploads/2015/12/2-7.jpg",
      "https://www.embassyindia.com/wp-content/uploads/2015/12/4-3.jpg",
      "https://www.embassyindia.com/wp-content/uploads/2015/12/3-6.jpg"
    ],
    "address": "B-12 Salt Lake, Kolkata",
    "bathrooms": 2,
    "bedrooms": 3,
    "furnished": false,
    "parking": true,
    "type": "house",
    "offer": false,
    "userRef": "<USER_ID_PLACEHOLDER>",
    "location": "Kolkata",
    "email": "<EMAIL_PLACEHOLDER>"
  },
  {
    "name": "Indiranagar Urban Flat Bangalore",
    "description": "Discover urban living at its finest in this trendy 2BHK flat located in the heart of Indiranagar, Bangalore. The apartment is designed for modern professionals and families, featuring a spacious balcony that overlooks the cityscape. The interiors are finished with high-quality materials, including hardwood flooring and custom cabinetry. The modern kitchen is fully equipped, making meal preparation a joy. Both bedrooms are generously sized, with large windows that let in plenty of natural light. The building offers secure parking and 24/7 security, ensuring peace of mind. Residents have access to a fitness center, rooftop terrace, and community lounge. The location is unbeatable, with cafes, restaurants, and tech parks just a short walk away. Public transport is easily accessible, making commuting hassle-free. This flat is perfect for those who want to experience the vibrant lifestyle of Bangalore while enjoying the comforts of a well-appointed home.",
    "regularPrice": 22000000,
    "discountedPrice": 20000000,
    "imageUrls": [
      "https://www.embassyindia.com/wp-content/uploads/2015/12/1-23.jpg",
      "https://www.embassyindia.com/wp-content/uploads/2015/12/3-5.jpg",
      "https://www.embassyindia.com/wp-content/uploads/2015/12/1-24.jpg"
    ],
    "address": "201 Indiranagar Main Road, Bangalore",
    "bathrooms": 2,
    "bedrooms": 2,
    "furnished": true,
    "parking": false,
    "type": "apartment",
    "offer": true,
    "userRef": "<USER_ID_PLACEHOLDER>",
    "location": "Bangalore",
    "email": "<EMAIL_PLACEHOLDER>"
  },
  {
    "name": "Banjara Hills Penthouse Hyderabad",
    "description": "Experience the height of luxury in this penthouse located in the prestigious Banjara Hills, Hyderabad. The property features a private terrace with panoramic city views, perfect for entertaining guests or relaxing in solitude. The spacious living area is adorned with designer furnishings and elegant decor, creating an ambiance of sophistication. The gourmet kitchen is equipped with premium appliances, making it a delight for home chefs. Four large bedrooms offer comfort and privacy, each with en-suite bathrooms and walk-in closets. The master suite includes a jacuzzi and a private balcony. Residents enjoy access to exclusive amenities such as a swimming pool, fitness center, and concierge services. The penthouse is situated in a secure building with 24/7 security and dedicated parking. Its central location means you are close to top schools, hospitals, and shopping centers. This property is ideal for those who seek a blend of luxury, convenience, and breathtaking views in one of Hyderabad's most sought-after neighborhoods.",
    "regularPrice": 40000000,
    "discountedPrice": 37000000,
    "imageUrls": [
      "https://www.embassyindia.com/wp-content/uploads/2017/03/About2-1-1.jpg",
      "https://www.embassyindia.com/wp-content/uploads/2015/12/2-19.jpg",
      "https://www.embassyindia.com/wp-content/uploads/2015/12/3-17.jpg"
    ],
    "address": "9 Banjara Hills, Hyderabad",
    "bathrooms": 4,
    "bedrooms": 4,
    "furnished": true,
    "parking": true,
    "type": "penthouse",
    "offer": true,
    "userRef": "<USER_ID_PLACEHOLDER>",
    "location": "Hyderabad",
    "email": "<EMAIL_PLACEHOLDER>"
  },
  {
    "name": "Sector 17 Family Home Chandigarh",
    "description": "This spacious family home is located in the peaceful Sector 17 of Chandigarh, offering a perfect blend of comfort and convenience. The property features a beautifully landscaped garden, ideal for outdoor activities and family gatherings. The large kitchen is equipped with modern appliances and ample storage, making it a delight for home cooks. Four bedrooms provide plenty of space for family members or guests, each with built-in wardrobes and large windows. The living and dining areas are designed for both relaxation and entertaining, with elegant finishes and plenty of natural light. The home is situated in a safe neighborhood, close to top schools, parks, and shopping centers. Additional amenities include secure parking, high-speed internet, and a dedicated utility area. This property is perfect for families seeking a peaceful and comfortable lifestyle in one of Chandigarh's most desirable areas.",
    "regularPrice": 21000000,
    "discountedPrice": 19000000,
    "imageUrls": [
      "https://www.embassyindia.com/wp-content/uploads/2017/03/About3-4-1.jpg",
      "https://www.embassyindia.com/wp-content/uploads/2015/12/4-10.jpg",
      "https://www.embassyindia.com/wp-content/uploads/2015/12/5-4.jpg"
    ],
    "address": "17/2 Sector 17, Chandigarh",
    "bathrooms": 3,
    "bedrooms": 4,
    "furnished": false,
    "parking": true,
    "type": "house",
    "offer": false,
    "userRef": "<USER_ID_PLACEHOLDER>",
    "location": "Chandigarh",
    "email": "<EMAIL_PLACEHOLDER>"
  },
  {
    "name": "MG Road Executive Suite Pune",
    "description": "Located in the bustling MG Road area of Pune, this executive suite offers a perfect blend of luxury and functionality. The suite is fully furnished, featuring a dedicated home office, access to a state-of-the-art gym, and 24/7 security for peace of mind. The living area is spacious and elegantly decorated, while the kitchen is equipped with modern appliances and ample storage. Two bedrooms provide comfort and privacy, each with en-suite bathrooms and built-in wardrobes. The property is situated in a prime location, close to major business hubs, shopping centers, and entertainment options. Additional amenities include secure parking, high-speed internet, and a private balcony. This suite is ideal for professionals and families seeking a premium lifestyle in one of Pune's most vibrant neighborhoods.",
    "regularPrice": 25000000,
    "discountedPrice": 23000000,
    "imageUrls": [
      "https://images.unsplash.com/photo-1506744038136-46273834b3fb",
      "https://images.unsplash.com/photo-1465101178521-c1a9136a3b99",
      "https://images.unsplash.com/photo-1467987506553-8f3916508521"
    ],
    "address": "501 MG Road, Pune",
    "bathrooms": 2,
    "bedrooms": 2,
    "furnished": true,
    "parking": true,
    "type": "apartment",
    "offer": false,
    "userRef": "<USER_ID_PLACEHOLDER>",
    "location": "Pune",
    "email": "<EMAIL_PLACEHOLDER>"
  },
  {
    "name": "Civil Lines Colonial Home Allahabad",
    "description": "Step back in time with this colonial-style home located in the historic Civil Lines area of Allahabad. The property features high ceilings, vintage flooring, and a large veranda that wraps around the house, offering a perfect spot for morning tea or evening relaxation. The spacious living and dining areas are adorned with period furnishings and elegant decor, creating an ambiance of old-world charm. The kitchen is fully equipped with modern appliances, blending functionality with classic style. Three bedrooms provide comfort and privacy, each with large windows and built-in wardrobes. The home is situated in a quiet neighborhood, close to top schools, parks, and cultural attractions. Additional amenities include secure parking, high-speed internet, and a dedicated utility area. This property is ideal for heritage lovers and families seeking a unique living experience in one of Allahabad's most prestigious neighborhoods.",
    "regularPrice": 7000000,
    "discountedPrice": 6000000,
    "imageUrls": [
      "https://images.unsplash.com/photo-1465101046530-73398c7f28ca",
      "https://images.unsplash.com/photo-1464037866556-6812c9d1c72e",
      "https://images.unsplash.com/photo-1512918728675-ed5a9ecdebfd"
    ],
    "address": "22 Civil Lines, Allahabad",
    "bathrooms": 2,
    "bedrooms": 3,
    "furnished": false,
    "parking": true,
    "type": "house",
    "offer": true,
    "userRef": "<USER_ID_PLACEHOLDER>",
    "location": "Allahabad",
    "email": "<EMAIL_PLACEHOLDER>"
  }
] 